//1.Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной на экран с помощью метода alert.
// const num = 3;
// alert(num);


//2.Создайте переменные a=10 и b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).
// const a = 10;
// const b = 2;

// console.log(a + b, 'sum');
// console.log(a - b, 'res');
// console.log(a * b, 'mult');
// console.log(a / b, 'div');


//3.Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.
// const c = 15;
// const d = 2; 
// const result = c + d;

// console.log(result, 'result');

//4.Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.
// const a = 10;
// const b = 2;
// const c = 5;

// function Sum(d, f, g) {
//     const sum = d + f + g;
//     console.log(sum, 'sum #4');
// }
// Sum(a, b, c);

 /*5.Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат 
 присвойте переменной c. Затем создайте переменную d, присвойте ей значение  7. 
 Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.*/

// const a = 17;
// const b = 10;
// const d = 7;

// function Five(q, w, e) {
//     const c = q - w;
//     const result = e + c;
//     console.log(result, '#5');
// }

// Five(a, b, d);

//6. Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.
// const str = 'Привет, мир!';
// console.log(str, '#6');

//7.Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.
// const str1 = 'Привет, ';
// const str2 = 'Мир!';

// const str = `${str1}${str2}`;

// console.log(str, '#7');

 //8.Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, %Имя%!'.
 
// let name = '';

// name = 'Liza';
// const str = `Привет, ${name}`;


// console.log(str, '#8');

/*9.Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.*/

const age = 22;
const str = `Мне ${age} года!`;
console.log(str);