// 1 -- информативные
//2 -- всё хорошо (саксэсс) успех коды
// 3 -- переадрусация
// 4 -- клиент
// 5 -- сервер
// hhtp - незащищенное соединени
// https -- tsl/ssl (сертивфикаты) 
        // протокол рукопажатия



let obj = [1, 2];
let arr = obj;
console.log(obj == arr);



// обработчик ошибок

// try {
//     ghbgh()
//     //проверка кода
// } catch(error) {
//     alert('error');
//     // работа с ошибкой
// } finally {
//     alert('hi');
//     // после обработки 
//     // что сделать с кодом после обработки
// }

//throw --- создать свою ошибку
















